In [1]:
import pandas as pd

# Setting to make numbers easier to read on display
pd.options.display.float_format = '{:20.2f}'.format

# Show all columns on output
pd.set_option('display.max_columns', 999)

In [46]:
df = pd.read_csv('train.csv')

In [9]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.46,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.00,0,0,17463,51.86,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.07,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.00,0,2,347742,11.13,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,0,237736,30.07,NaN,C

In [10]:
df.shape

(891, 12)

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.00,891.00,891.00,714.00,891.00,891.00,891.00
mean,446.00,0.38,2.31,29.70,0.52,0.38,32.20
std,257.35,0.49,0.84,14.53,1.10,0.81,49.69
min,1.00,0.00,1.00,0.42,0.00,0.00,0.00
25%,223.50,0.00,2.00,20.12,0.00,0.00,7.91
50%,446.00,0.00,3.00,28.00,0.00,0.00,14.45
75%,668.50,1.00,3.00,38.00,1.00,0.00,31.00
max,891.00,1.00,3.00,80.00,8.00,6.00,512.33

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [18]:
df.duplicated().sum()

0

In [ ]:
'''
Cleaning

Fix missing values Age and Cabin

Separete Pclass into 3 new columns = 1 = Upper_class, 2 = Middle_class and 3 = Lower_class

Separete Embarked into 3 columns = C = Cherbourg, Q = Queenstown and S = Southampton

Transform Sex into a binary Male and Female column

Drop - Name, Ticket and Fare

'''

In [75]:
cleaned_df = df.copy()

In [76]:
# missing values

# Age

# creating a median by group: Pclass + Sex and filling all the nans
cleaned_df["Age"] = cleaned_df.groupby(["Pclass", "Sex"])["Age"].transform(
    lambda x: x.fillna(x.median())
)

# Cabin

# instead of filling the nans, create a new Has_Cabin column
cleaned_df["Has_Cabin"] = cleaned_df["Cabin"].notna().astype(int)

# results
cleaned_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Has_Cabin        0
dtype: int64

In [77]:
# Pclass

# creating dummies
cleaned_df = pd.get_dummies(cleaned_df, columns=["Pclass"])

# renaming
cleaned_df = cleaned_df.rename(columns={
    "Pclass_1": "Upper_class",
    "Pclass_2": "Middle_class",
    "Pclass_3": "Lower_class"
})

cleaned_df[["Upper_class", "Middle_class", "Lower_class"]] = cleaned_df[["Upper_class", "Middle_class", "Lower_class"]].astype(int)

# results
cleaned_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Has_Cabin,Upper_class,Middle_class,Lower_class
0,1,0,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S,0,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C,1,1,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,S,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,S,1,1,0,0
4,5,0,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,S,0,0,0,1

In [78]:
# Embarked

# creating dummies
cleaned_df = pd.get_dummies(cleaned_df, columns=["Embarked"])

# renaming
cleaned_df = cleaned_df.rename(columns={
    "Embarked_C": "Cherbourg",
    "Embarked_Q": "Queenstown",
    "Embarked_S": "Southampton"
})

cleaned_df[["Cherbourg", "Queenstown", "Southampton"]] = cleaned_df[["Cherbourg", "Queenstown", "Southampton"]].astype(int)

# results
cleaned_df.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Has_Cabin,Upper_class,Middle_class,Lower_class,Cherbourg,Queenstown,Southampton
0,1,0,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,0,0,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,1,1,0,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,0,0,0,1,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,1,1,0,0,0,0,1
4,5,0,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,0,0,0,1,0,0,1

In [79]:
# Sex

# creating dummies
cleaned_df = pd.get_dummies(cleaned_df, columns=["Sex"])

# rename
cleaned_df = cleaned_df.rename(columns={
    "Sex_male": "Male",
    "Sex_female": "Female"
})

cleaned_df[["Male", "Female"]] = cleaned_df[["Male", "Female"]].astype(int)

# results
cleaned_df.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Has_Cabin,Upper_class,Middle_class,Lower_class,Cherbourg,Queenstown,Southampton,Female,Male
0,1,0,"Braund, Mr. Owen Harris",22.00,1,0,A/5 21171,7.25,NaN,0,0,0,1,0,0,1,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.00,1,0,PC 17599,71.28,C85,1,1,0,0,1,0,0,1,0
2,3,1,"Heikkinen, Miss. Laina",26.00,0,0,STON/O2. 3101282,7.92,NaN,0,0,0,1,0,0,1,1,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.00,1,0,113803,53.10,C123,1,1,0,0,0,0,1,1,0
4,5,0,"Allen, Mr. William Henry",35.00,0,0,373450,8.05,NaN,0,0,0,1,0,0,1,0,1

In [81]:
# dropping
cleaned_df = cleaned_df.drop(columns=["Name", "Ticket", "Fare", "Cabin"])

# final df
cleaned_df.head()

,PassengerId,Survived,Age,SibSp,Parch,Has_Cabin,Upper_class,Middle_class,Lower_class,Cherbourg,Queenstown,Southampton,Female,Male
0,1,0,22.00,1,0,0,0,0,1,0,0,1,0,1
1,2,1,38.00,1,0,1,1,0,0,1,0,0,1,0
2,3,1,26.00,0,0,0,0,0,1,0,0,1,1,0
3,4,1,35.00,1,0,1,1,0,0,0,0,1,1,0
4,5,0,35.00,0,0,0,0,0,1,0,0,1,0,1